---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionId.#ctor(System.Guid)
source: html/d8c33d58-de02-1ca4-3d3b-57a806b6dc33.htm
---
# Autodesk.Revit.DB.FailureDefinitionId.#ctor Method

Creates a new FailureDefinitionId instance.

## Syntax (C#)
```csharp
public FailureDefinitionId(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the FailureDefinitionId.